src/DataProcessors/инк2НДФЛ/инк2НДФЛ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>инк2НДФЛ</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеречисленоСНачалаГода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКорректировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачисленоСНачалаГода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Признак</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентУплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.инкОрганизации</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/AccumulationRegisters/инкНалогУдержанный/инкНалогУдержанный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>инкНалогУдержанный</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаНалога</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.инкОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.инкПодразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НалоговаяСтавка</name>
    <type>
      <types>EnumRef.инкНДФЛСтавкиНалогообложенияРезидента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.инкНачислениеЗарплаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИсточникФинансирования</name>
    <type>
      <types>CatalogRef.инкИсточникиФинансирования</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/DataProcessors/инк2НДФЛ/Forms/Форма/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначениямиПоУмолчанию();
	ПересчитатьДанныеНаФорме();
	
КонецПроцедуры                    

&НаСервере
Процедура ЗаполнитьЗначениямиПоУмолчанию()

	Объект.Год = ТекущаяДата();
	Объект.Организация = Справочники.инкОрганизации.ПолучитьТекущуюОрганизацию();
	Объект.Признак = "1";
	Объект.НомерКорректировки = "00";
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ПересчитатьДанныеНаФорме();
КонецПроцедуры

&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	ПересчитатьДанныеНаФорме();
КонецПроцедуры

&НаКлиенте
Процедура СуммаУплаченногоНалогаПриИзменении(Элемент)
	Объект.ПроцентУплаты = ПолучитьПроцентУплаты();
КонецПроцедуры

Процедура ПересчитатьДанныеНаФорме()

	Объект.НачисленоСНачалаГода = ПолучитьСуммуУдержанногоНалога();
	Объект.ПроцентУплаты = ПолучитьПроцентУплаты();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПроцентУплаты()
	
	ПроцентУплаты = 0;
	
	Если Объект.НачисленоСНачалаГода <> 0 Тогда
		ПроцентУплаты = Объект.ПеречисленоСНачалаГода / Объект.НачисленоСНачалаГода * 100;		
	КонецЕсли;           
	
	Если ПроцентУплаты > 100 Тогда
		ПроцентУплаты = 100;
	КонецЕсли;
	
	Возврат ПроцентУплаты;
	
КонецФункции

&НаСервере
Функция ПолучитьСуммуУдержанногоНалога()
	
	ОблагаемыеДоходы = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	инкНалогУдержанныйОбороты.Организация КАК Организация,
		|	инкНалогУдержанныйОбороты.СуммаНалогаОборот КАК СуммаНалогаОборот
		|ИЗ
		|	РегистрНакопления.инкНалогУдержанный.Обороты(&Дата1, &Дата2, , Организация = &Организация) КАК инкНалогУдержанныйОбороты";
	
	Запрос.УстановитьПараметр("Дата1", НачалоГода(Объект.Год));
	Запрос.УстановитьПараметр("Дата2", КонецГода(Объект.Год));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОблагаемыеДоходы = ОблагаемыеДоходы + ВыборкаДетальныеЗаписи.СуммаНалогаОборот;
	КонецЦикла;
	
	Возврат ОблагаемыеДоходы;

КонецФункции	

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область о // Печать:

&НаКлиенте
Процедура Печать(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВыборСотрудниковЗавершение", ЭтотОбъект);
		   
	ВыборкаПериод = Новый СтандартныйПериод;
	ВыборкаПериод.ДатаНачала = НачалоГода(Объект.Год);
	ВыборкаПериод.ДатаОкончания = КонецГода(Объект.Год);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Организация",Объект.Организация);  
	ПараметрыОткрытия.Вставить("Период",ВыборкаПериод);  
		   
	ОткрытьФорму("ОбщаяФорма.инкВыборСотрудников", 
		ПараметрыОткрытия,
		ЭтотОбъект,
		УникальныйИдентификатор,
		,
		,
		Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборСотрудниковЗавершение(Знач РезультатРедактирования, Знач ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатРедактирования) Тогда
		
		ТабличныйДокумент = ПолучитьТабличныйДокументНаСервере(РезультатРедактирования);
		инкОтчетыКлиент.ПечатьТабличногоДокумента(ТабличныйДокумент,"Справка 2 НДФЛ",ЭтаФорма);
			
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьТабличныйДокументНаСервере(ПараметрыПечати)
	
	МенеджерПечати = РеквизитФормыВЗначение("Объект");
	МенеджерПечати.Сотрудники = ПараметрыПечати.Сотрудники;
	МенеджерПечати.Организация = ПараметрыПечати.Организация;
	ТабличныйДокумент = МенеджерПечати.ПолучитьРезультатРасчета();

	Возврат ТабличныйДокумент; 
	
КонецФункции

#КонецОбласти

#КонецОбласти
